In [15]:
import pandas as pd
import numpy as np

#Read csv

dataset = pd.read_csv("Titanic_dataset.csv")
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [19]:
# 1. Kazada ölenlerin yaş ortalamasını bulunuz
result = dataset[dataset['Survived'] == 0]['Age'].mean()
print(result)

30.62617924528302

In [21]:
# 2. Kazada ölenlerin bilet fiyatlarının ortalamasını ve medyanını bulunuz
mean = dataset[dataset['Survived'] == 0]['Fare'].mean()
median = dataset[dataset['Survived'] == 0]['Fare'].median()

print(mean)
print(median)

22.117886885245902
10.5

In [27]:
# 3. Kazada ölen erkeklerin yaş ortalamasını bulunuz
result = dataset[(dataset['Survived'] == 0) & (dataset['Sex'] == 'male')]['Age'].mean()
print(result)

31.618055555555557

In [29]:
# 4. Kazada ölen Kadınların yaş ortalamasını bulunuz
result = dataset[(dataset['Survived'] == 0) & (dataset['Sex'] == 'female')]['Age'].mean()
print(result)

25.046875

In [31]:
# 5. Kazadan kurtulanların yaş ortalamasını bulunuz
result = dataset[dataset['Survived'] == 1]['Age'].mean()
print(result)

28.343689655172415

In [35]:
# 6. Kazadan kurtulanların bilet fiyatlarının ortalamasını bulunuz
result = dataset[dataset['Survived'] == 1]['Fare'].mean()
print(result)

48.39540760233918

In [37]:
# 7. Kazadan kurtulan toplam kişi sayısını bulunuz… 
result = len(dataset[dataset['Survived'] == 1])
print(result)

342

In [39]:
# 8. 10 yaşından küçüklerin bilet fiyatlarının medyan değerini bulunuz
result = dataset[dataset['Age'] < 10]['Fare'].median()
print(result)

27.0

In [47]:
# 9. 1.sınıf, 2.sınıf ve 3.sınıf bilet fiyatlarının ortalama ve medyanlarını karşılaştırınız. (Pclass değişkeni sınıfları barındırmaktadır.)
dataset.groupby("Pclass")["Fare"].agg(["mean", "median"])

             mean   median
Pclass
1       84.154687  60.2875
2       20.662183  14.2500
3       13.675550   8.0500

In [55]:
# 10. Kazada ölen kadınların oranı ile erkeklerin oranını karşılaştırınız. 
#(Örnek: erkekler için; ölen erkeklerin, erkek sayısına bölümü bu oranı vermektedir.

numberOfMale = len(dataset[dataset['Sex'] == 'male'])
numberOfDeadMale = len(dataset[(dataset['Survived'] == 0) & (dataset['Sex'] == 'male')])
ratioMale = numberOfDeadMale / numberOfMale

numberOfFemale = len(dataset[dataset['Sex'] == 'female'])
numberOfDeadFemale = len(dataset[(dataset['Survived'] == 0) & (dataset['Sex'] == 'female')])
ratioFemale = numberOfDeadFemale / numberOfFemale

print("Ratio male:", ratioMale * 100)
print("Ratio female:", ratioFemale * 100)

Ratio male: 81.10918544194108
Ratio female: 25.796178343949045